In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt

In [2]:
from sqlalchemy import create_engine

engine = create_engine(
    "postgresql://robot-startml-ro:pheiph0hahj1Vaif@"
    "postgres.lab.karpov.courses:6432/startml"
)

In [3]:
user_data = pd.read_sql(
    """SELECT * FROM public.user_data""",
    con = engine
)
user_data

,user_id,gender,age,country,city,exp_group,os,source
0,200,1,34,Russia,Degtyarsk,3,Android,ads
1,201,0,37,Russia,Abakan,0,Android,ads
2,202,1,17,Russia,Smolensk,4,Android,ads
3,203,0,18,Russia,Moscow,1,iOS,ads
4,204,0,36,Russia,Anzhero-Sudzhensk,3,Android,ads
...,...,...,...,...,...,...,...,...
163200,168548,0,36,Russia,Kaliningrad,4,Android,organic
163201,168549,0,18,Russia,Tula,2,Android,organic
163202,168550,1,41,Russia,Yekaterinburg,4,Android,organic
163203,168551,0,38,Russia,Moscow,3,iOS,organic
163204,168552,1,16,Russia,Ivanteyevka,4,Android,organic

In [4]:
post_data = pd.read_sql(
    """SELECT * FROM public.post_text_df""",
    con = engine
)
post_data

      post_id                                               text     topic
0           1  UK economy facing major risks\n\nThe UK manufa...  business
1           2  Aids and climate top Davos agenda\n\nClimate c...  business
2           3  Asian quake hits European shares\n\nShares in ...  business
3           4  India power shares jump on debut\n\nShares in ...  business
4           5  Lacroix label bought by US firm\n\nLuxury good...  business
...       ...                                                ...       ...
7018     7315  OK, I would not normally watch a Farrelly brot...     movie
7019     7316  I give this movie 2 stars purely because of it...     movie
7020     7317  I cant believe this film was allowed to be mad...     movie
7021     7318  The version I saw of this film was the Blockbu...     movie
7022     7319  Piece of subtle art. Maybe a masterpiece. Doub...     movie

[7023 rows x 3 columns]

In [8]:
feed_data = pd.read_sql(
    """SELECT * FROM public.feed_data LIMIT 500000""",
    con = engine
)
feed_data

                 timestamp  user_id  post_id action  target
0      2021-10-17 12:34:04   158218     1122   view       0
1      2021-10-17 12:34:52   158218     2482   view       0
2      2021-10-17 12:36:53   158218     3432   view       0
3      2021-10-17 12:38:03   158218     2024   view       1
4      2021-10-17 12:38:33   158218     2024   like       0
...                    ...      ...      ...    ...     ...
499995 2021-11-01 09:33:46    16282     2149   view       1
499996 2021-11-01 09:33:57    16282     2149   like       0
499997 2021-11-01 09:33:59    16282     1242   view       0
499998 2021-11-01 09:36:03    16282     3613   view       0
499999 2021-11-01 09:36:45    16282     5021   view       1

[500000 rows x 5 columns]

### Работа с данными

In [9]:
feed_data = feed_data[feed_data['action'] == 'view']